{
  "backend/main.mo": "Defines the main canister actor with all core data types for incidents, messages, evidence, police submissions, summaries, and place lookup structures.",
  "backend/police-department.mo": "Defines the PoliceDepartment type containing basic department contact and address fields.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile type with personal, location, vehicle, and social media fields.",
  "feature_evidence.json": "Specifies feature evidence entries mapping features to impacted files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files describing component behavior and implementation details.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables, dark mode values, and base layout rules.",
  "frontend/index.html": "Main HTML entry file setting PWA metadata, icons, titles, and linking the application root and main script.",
  "frontend/public/manifest.json": "PWA manifest defining app name, description, colors, icons, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling pre-caching, runtime caching, activation cleanup, fetch strategy, and skip-waiting messages.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, profile setup, main content rendering, and global providers.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/CrimeHelp.tsx": "Renders an educational page with cards explaining legal rights, crime definitions, and external resources. Includes visuals, icons, and a link opener to womenslaw.org.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with copyright text and a link to caffeine.ai. Includes a heart icon styled with primary colors.",
  "frontend/src/components/Header.tsx": "Provides the app header with branding, login/logout handling via Internet Identity, and a light/dark theme toggle. Shows user profile initials when authenticated.",
  "frontend/src/components/IncidentDetail.tsx": "Shows detailed incident information including messages, evidence, stalker data, and police department lookup. Supports generating messages, viewing evidence, and selecting or saving police departments.",
  "frontend/src/components/IncidentForm.tsx": "Form for creating or supplementing an incident report with fields, validation, file uploads, and optional stalker profile association. Handles evidence upload progress and report type selection dialogs.",
  "frontend/src/components/IncidentHistory.tsx": "Fetches and displays the user’s list of incidents with loading and error states, allowing selection to open the full incident detail view. Supports optional auto-selection via props and refresh actions.",
  "frontend/src/components/InstallationGuide.tsx": "File exists but contains no content.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Displays a user’s compiled incident summary with loading, error, and empty states, formatting dates and tone intensities for presentation.",
  "frontend/src/components/LoginPrompt.tsx": "Shows the login screen with branding, feature descriptions, and an Internet Identity login button.",
  "frontend/src/components/MainContent.tsx": "Provides the main authenticated app layout with tabs for victim info, stalker info, reports, history, and evidence sections.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Placeholder component with no current implementation.",
  "frontend/src/components/MessageGenerator.tsx": "UI for generating contextual warning or documentation messages based on tone and intensity selections for a specific incident.",
  "frontend/src/components/MessageList.tsx": "Renders a list of generated messages with metadata and actions like copy, share, and SMS sending.",
  "frontend/src/components/MotivationalVideo.tsx": "Empty placeholder component with no implemented functionality.",
  "frontend/src/components/PoliceReportDialog.tsx": "Dialog for assembling and submitting a police report with selectable evidence, victim info options, summaries, and disclaimer acknowledgement.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Displays a history of police submission logs, including timestamps, success status, narratives, and attached evidence details.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form allowing the user to enter and save their name during initial profile setup.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Handles showing a PWA install prompt, including deferred Android prompts and iOS home‑screen instructions, with logic for dismissals and install state.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "Manages viewing, editing, loading, and deleting saved stalker profiles with dialogs and form controls.",
  "frontend/src/components/StalkerRecord.tsx": "Main interface for creating or editing stalker information, managing saved profiles, and handling police department search and selection.",
  "frontend/src/components/VictimProfile.tsx": "Renders a form for viewing and editing optional victim profile fields, syncing data with backend via save and fetch hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Derives actor readiness state from React Query cache, reporting readiness, initialization, or errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and identity lifecycle.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that persists state to localStorage, syncing changes automatically.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user, stalker, victim, and incident-related data through the backend actor.",
  "frontend/src/index.css": "Tailwind base and custom theme definitions including color variables and utility classes for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/types.ts": "Re-exports backend type definitions and enums for consistent frontend typing.",
  "frontend/src/utils/actorInitErrorMessage.ts": "Provides standardized user-friendly error messages for actor initialization and maps errors to readable descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing) and persisting them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/src/utils/waitForActorReady.ts": "Polls React Query’s actor queries until they finish loading, error out, or timeout to avoid initialization race conditions.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, breakpoints, animations, container settings, and loading typography, container-query, and animation plugins.",
  "project_state.json": "Tracks project state, revert goals, branding/icon requirements, issues, and feature request metadata."
}