{
  "backend/main.mo": "Primary backend actor defining all core types for incidents, messages, evidence, summaries, police submissions, and integrations with authorization, storage, and migration.",
  "backend/migration.mo": "Migration module that keeps actor state unchanged by returning the old state directly.",
  "backend/police-department.mo": "Defines the PoliceDepartment type with basic contact and address fields.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile type including personal, location, and vehicle details.",
  "feature_evidence.json": "Feature evidence file linking a DV Journal cache-invalidation fix to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components and hooks.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables and light/dark mode palettes.",
  "frontend/index.html": "Main HTML entry with PWA metadata, icons, theming, and script loader for the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, theme colors, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker handling precaching, runtime caching, activation cleanup, fetch strategies, and skip-waiting messages.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile setup flow, quick-exit shortcut, theming, and layout structure.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/CrimeHelp.tsx": "Presents educational cards on legal rights, crime definitions, and external resources for women's safety. Includes UI elements, icons, and a link to womenslaw.org.",
  "frontend/src/components/DVJournalSection.tsx": "Manages DV journal entries, abuser name, risk detection, and analysis using multiple queries and mutations. Provides UI for editing, adding entries, viewing risk, and handling stalker profiles.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, authentication controls, theme toggle, and quick‑exit behavior. Integrates user profile data and identity login logic.",
  "frontend/src/components/ImmediateHelpSafetyPlan.tsx": "Shows emergency contact options, safety warnings, and hotline links using cards and alerts. Provides tap‑to‑call buttons for 911, DV hotline, and crisis text resources.",
  "frontend/src/components/IncidentDetail.tsx": "Displays detailed incident data including messages, evidence, stalker info, and nearest police department. Supports message generation, police report dialog, and department selection with auto‑refresh.",
  "frontend/src/components/IncidentForm.tsx": "Form component for creating incidents with validation, file uploads, and optional linking to a stalker profile.",
  "frontend/src/components/IncidentHistory.tsx": "Displays the user’s past incidents with loading, error, and detail view handling.",
  "frontend/src/components/InstallationGuide.tsx": "Provides step-by-step PWA installation instructions and shareable app links.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Generates and displays an AI‑compiled summary of all incidents with tone analysis and metadata.",
  "frontend/src/components/LoginPrompt.tsx": "Landing/login screen prompting users to authenticate via Internet Identity and showcasing app features.",
  "frontend/src/components/MainContent.tsx": "Main tabbed dashboard managing user profile, incident creation, navigation, and section rendering.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Empty placeholder component with no content.",
  "frontend/src/components/MessageGenerator.tsx": "UI for generating incident‑based messages, allowing users to select tone and intensity and submit generation requests.",
  "frontend/src/components/MessageList.tsx": "Displays generated messages with copy, share, and SMS options, including tone and intensity labeling.",
  "frontend/src/components/MotivationalVideo.tsx": "Empty placeholder component with no content.",
  "frontend/src/components/PoliceReportDialog.tsx": "Dialog for assembling and submitting a police report with selected evidence, victim info, and incident narrative.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Displays a user's police submission logs with status, evidence details, and error/loading states. Includes formatting utilities for dates, file types, and file sizes.",
  "frontend/src/components/ProfileDeleteConfirmDialog.tsx": "Provides a confirmation dialog for deleting a saved profile with async handling and disabled states during deletion.",
  "frontend/src/components/ProfileSetup.tsx": "Allows users to create a profile by submitting their name, with validation and success/error toasts.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Handles showing and managing a PWA installation prompt with iOS and reinstall logic.",
  "frontend/src/components/QuickExitSettings.tsx": "Lets users configure and save a custom Quick Exit URL with validation, reset functionality, and feedback alerts.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "Manages viewing, editing, loading, and deleting saved stalker profiles using dialogs and async mutations.",
  "frontend/src/components/StalkerRecord.tsx": "Provides a full interface for managing current stalker info, adding profiles, and handling police department data with tabs, forms, and CRUD operations.",
  "frontend/src/components/VictimProfile.tsx": "React component for viewing and editing optional victim profile fields with save functionality and form state management.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Derives readiness, initialization, and error state for the backend actor based on React Query cache.",
  "frontend/src/hooks/useDVJournalQueries.ts": "Provides React Query hooks for DV journal operations including reading, writing, permission checks, and actor readiness handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, stored identities, and context access for the app.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs React state with localStorage for persistence.",
  "frontend/src/hooks/usePwaInstall.ts": "Detects PWA install availability, platform conditions, and provides a prompt handler for installation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, incidents, stalker data, victim profiles, and related backend interactions with actor readiness checks.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark mode, and custom utility classes including gradients and red chat styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/types.ts": "Re-exports shared backend types and enums for consistent frontend typing.",
  "frontend/src/utils/actorInitErrorMessage.ts": "Maps various actor initialization and network errors to user-friendly messages.",
  "frontend/src/utils/highRiskKeywords.ts": "Defines high‑risk keywords and utilities to detect them in text.",
  "frontend/src/utils/normalizeTimestampMs.ts": "Normalizes timestamps across units and formats them safely into readable dates.",
  "frontend/src/utils/quickExit.ts": "Manages quick-exit URL validation, storage, and immediate redirect behavior.",
  "frontend/src/utils/shareLink.ts": "Provides helpers to get share URLs, copy text, and use the Web Share API with fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URL and session storage logic.",
  "frontend/src/utils/waitForActorReady.ts": "Waits for actor queries in React Query to finish initializing before use, with timeout handling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, custom colors from CSS variables, breakpoints, animations, and plugins.",
  "project_state.json": "Defines project metadata and state, listing issues with DV journal abuser name persistence and outlines existing and new feature requests to fix backend and frontend behavior."
}