{
  "backend/main.mo": "Main Motoko canister actor defining core domain types (incidents, evidence, messages, police submissions, summaries) and integrating authorization, storage, profiles, police lookup, and HTTP outcalls to support incident reporting and evidence-backed police submissions.",
  "backend/police-department.mo": "Defines the PoliceDepartment record type with identifying and contact fields used when submitting reports to law enforcement.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile record type capturing identifying, location, vehicle, and social media details about a suspected stalker.",
  "feature_evidence.json": "Feature specification describing fixes and enhancements to the evidence upload flow, persistence, cache invalidation, and frontend error handling, including affected files and required components.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files, describing each component’s purpose, UI behavior, and recent evidence-upload–related improvements.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, light/dark themes, color system, and base styles for the entire frontend.",
  "frontend/index.html": "HTML entry point configuring metadata, PWA support, icons, SEO/social tags, and mounting the React application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, orientation, categories, and a shortcut for creating a new incident report.",
  "frontend/public/service-worker.js": "Custom service worker implementing precaching, runtime caching, cache cleanup, offline fallback behavior, and update handling for the PWA.",
  "frontend/src/App.tsx": "Root React component managing authentication, profile setup flow, theming, layout composition, and global UI elements like toasts and PWA install prompts.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty or placeholder component file intended for a future analytics dashboard, with no implementation present.",
  "frontend/src/components/CrimeHelp.tsx": "Renders an educational page with cards explaining women’s legal rights, crime definitions, and safety resources, including external links to legal information.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with copyright text, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Provides the app header with branding, theme toggle, and authentication controls using Internet Identity, showing user info when logged in.",
  "frontend/src/components/IncidentDetail.tsx": "Shows detailed information for a single incident, including messages, evidence, stalker info, and police reporting tools with auto-refresh of nearest police department.",
  "frontend/src/components/IncidentForm.tsx": "Implements a form to create new or supplemental incident reports, handling validation, stalker profile association, and evidence file uploads with progress tracking.",
  "frontend/src/components/IncidentHistory.tsx": "Lists a user’s past incidents with loading and error states, allows selecting an incident to view details, and supports refreshing and summary views.",
  "frontend/src/components/InstallationGuide.tsx": "Provides an installation and sharing guide with predefined social share messages, images, and tones to promote the ReportHer app across platforms. Includes UI for selecting share options and copying or sharing app links and messages.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Displays a summarized, interactive view of a user’s reported incidents, including dates, locations, media, and tone intensity analytics. Handles loading, error, and empty states while fetching data tied to the authenticated Internet Identity.",
  "frontend/src/components/LoginPrompt.tsx": "Renders a marketing-focused login screen prompting users to authenticate with Internet Identity, highlighting core features and benefits of the ReportHer app. Includes hero branding, feature cards, and a login action.",
  "frontend/src/components/MainContent.tsx": "Acts as the primary authenticated app layout, managing tabs, dropdown navigation, and state for incidents, profiles, and reports. Orchestrates major feature components like incident forms, history, police submissions, and installation guidance.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Empty placeholder file with no implemented logic or UI.",
  "frontend/src/components/MessageGenerator.tsx": "UI workflow for generating harassment warning or documentation messages based on incident data, selected tone, and intensity. Integrates with backend generation hooks and provides user feedback on success or failure.",
  "frontend/src/components/MessageList.tsx": "Renders a list of generated messages with metadata like tone and intensity, and provides actions to copy, share, or send messages via SMS. Logs SMS usage to the backend and handles loading and empty states.",
  "frontend/src/components/MotivationalVideo.tsx": "Displays an authenticated-only button that opens a dialog with a motivational video, handling loading, playback state, and manual play controls. Uses a modal dialog with custom overlays and video lifecycle management.",
  "frontend/src/components/PoliceReportDialog.tsx": "Provides a dialog workflow for submitting a police report with selected evidence, optional victim info and summaries, and legal acknowledgment. Integrates backend submission hooks and manages evidence selection, size calculation, and form state.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Displays a detailed, read-only history of police report submissions with timestamps, status, and attached evidence metadata. Handles loading, error, and empty states using backend query hooks.",
  "frontend/src/components/ProfileSetup.tsx": "Simple onboarding form that collects and saves a user's name to create a caller profile. Handles validation, submission state, and success or error feedback.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Shows a conditional prompt encouraging users to install the app as a PWA, handling browser install events, iOS-specific instructions, and dismissal persistence via localStorage.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "UI component that lists, views, edits, and deletes saved stalker profiles using dialogs and React Query hooks, and allows loading a profile into another workflow.",
  "frontend/src/components/StalkerRecord.tsx": "Main form-driven component for creating and managing stalker records, saving profiles, and associating police departments, with tabs for current vs saved data and extensive CRUD interactions.",
  "frontend/src/components/VictimProfile.tsx": "Optional victim information form that loads, edits, and securely saves personal details for inclusion in police reports, tracking unsaved changes.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Derived-state hook that reports whether the backend actor is ready, initializing, or errored by inspecting React Query cache state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook that manages Internet Identity authentication lifecycle, exposing identity, login/logout actions, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and mutations wrapping backend actor methods for user profiles, stalker profiles, victim data, police departments, and related domain entities, with actor-readiness handling.",
  "frontend/src/index.css": "Defines Tailwind base/components/utilities plus extensive CSS variables for light/dark themes using OKLCH colors, global base styles, custom gradients, and mobile-specific utility classes.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and renders App wrapped with React Query’s QueryClientProvider and the InternetIdentityProvider, and imports global styles.",
  "frontend/src/types.ts": "Re-exports shared domain types and enums from the backend module to keep frontend and backend type definitions consistent.",
  "frontend/src/utils/actorInitErrorMessage.ts": "Centralizes user-friendly error messages and provides a helper to map backend/actor initialization errors to readable messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, clearing them, and safely removing sensitive params from the URL.",
  "frontend/src/utils/waitForActorReady.ts": "Provides an async helper that polls React Query for actor queries to finish initializing, resolving when ready or rejecting on error/timeout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom breakpoints, OKLCH-based theme colors via CSS variables, layout defaults, animations, and plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state and feature set, describing ReportHer’s architecture, authentication, RBAC, profiles, incident reporting workflows, and related capabilities."
}