{
  "backend/main.mo": "Defines the backend actor with many public data types for incidents, messages, evidence, police submissions, summaries, and integrations with stalker profiles and police departments.",
  "backend/police-department.mo": "Declares a simple PoliceDepartment type holding basic address and contact details.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile type with optional personal, location, and vehicle information fields.",
  "feature_evidence.json": "Lists feature definitions related to DV Journal dropdown profile deletion, confirmation flow, and input state handling, including affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend React files, describing their functionality and recent feature updates.",
  "frontend/index.css": "Sets global Tailwind-based OKLCH color variables, theming rules, and base styles for light and dark modes.",
  "frontend/index.html": "Main HTML document configuring PWA metadata, icons, manifest, and root mounting point for the frontend app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, categories, and shortcuts for Reporther.",
  "frontend/public/service-worker.js": "Implements a cache-first service worker handling install, activate, fetch, and messaging events for offline support.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup flow, theming, and global quick-exit shortcut.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty placeholder file for an analytics dashboard component.",
  "frontend/src/components/CrimeHelp.tsx": "UI component showing educational cards and resources about crime definitions and legal rights.",
  "frontend/src/components/DVJournalSection.tsx": "Domestic violence journal module for managing abuser name, journal entries, risk analysis, and stalker profiles.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding and external link attribution.",
  "frontend/src/components/Header.tsx": "Header with branding, user info, authentication controls, theme toggle, and quick-exit button.",
  "frontend/src/components/ImmediateHelpSafetyPlan.tsx": "Component presenting emergency contacts, safety plan guidance, and quick-call links for crisis situations.",
  "frontend/src/components/IncidentDetail.tsx": "Displays detailed incident data, messages, evidence, and nearest police department info with options to generate messages or file police reports.",
  "frontend/src/components/IncidentForm.tsx": "Provides a form to create new or supplemental incident reports, handle file uploads, validate inputs, and submit data.",
  "frontend/src/components/IncidentHistory.tsx": "Shows a user's list of incidents, supports selecting an incident for detailed view, and handles loading or error states.",
  "frontend/src/components/InstallationGuide.tsx": "Presents installation instructions for adding the app to devices and offers shareable message templates with copy/share actions.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Generates and displays an AI‑produced summary of all incidents, showing tone analysis, dates, and key insights with loading and error handling.",
  "frontend/src/components/LoginPrompt.tsx": "Renders a login prompt and feature overview, using Internet Identity login handling and UI cards describing app capabilities.",
  "frontend/src/components/MainContent.tsx": "Provides main authenticated app interface with tab navigation for victim info, stalker info, reporting, history, and help sections.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Empty placeholder component file.",
  "frontend/src/components/MessageGenerator.tsx": "Generates harassment‑related warning or evidence messages based on selected tone and intensity, calling backend generation APIs.",
  "frontend/src/components/MessageList.tsx": "Displays generated messages with metadata, supports copying, sharing, SMS sending, and logs SMS usage.",
  "frontend/src/components/MotivationalVideo.tsx": "Empty placeholder component file.",
  "frontend/src/components/PoliceReportDialog.tsx": "Dialog UI for submitting a police report with optional victim info, narrative, and selected evidence uploads.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Displays a user's police report submission history with evidence details, timestamps, and status indicators.",
  "frontend/src/components/ProfileDeleteConfirmDialog.tsx": "Confirmation dialog for permanently deleting a saved profile with async delete handling.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form for creating a user profile by entering a name and saving it to the backend.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Shows a PWA install prompt, handling deferred installation events, dismissal logic, and iOS-specific instructions.",
  "frontend/src/components/QuickExitSettings.tsx": "Settings panel allowing users to set or reset the Quick Exit redirect URL with validation and persistence.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "Manages viewing, editing, loading, and deleting saved stalker profiles with dialogs and form handling.",
  "frontend/src/components/StalkerRecord.tsx": "Complex form component for managing stalker info and police department data with CRUD operations, tabs, and readiness checks.",
  "frontend/src/components/VictimProfile.tsx": "Form for viewing and updating optional victim profile data, synced with backend and Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Derives readiness and error state for the actor by inspecting React Query cache and actor fetch status.",
  "frontend/src/hooks/useDVJournalQueries.ts": "Provides queries and mutations for DV journal features, ensuring actor readiness, permissions, and normalized timestamps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context using Internet Identity, handling login, identity restoration, and status management.",
  "frontend/src/hooks/useLocalStorageState.ts": "Hook that syncs state to localStorage with JSON serialization and error handling.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installation prompts, iOS detection, and install state tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, stalker, and related profiles using an actor with authentication handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode themes, and custom gradient and chat-related utility classes.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/types.ts": "Re-exports backend types and enums for consistent frontend type usage.",
  "frontend/src/utils/actorInitErrorMessage.ts": "Maps actor initialization and network errors to user-friendly message strings.",
  "frontend/src/utils/highRiskKeywords.ts": "Defines high-risk keywords and provides helpers to detect them in text.",
  "frontend/src/utils/normalizeTimestampMs.ts": "Normalizes timestamps across units and formats them safely into readable dates.",
  "frontend/src/utils/quickExit.ts": "Implements Quick Exit URL storage, validation, and immediate redirect behavior.",
  "frontend/src/utils/shareLink.ts": "Provides helpers for sharing URLs using Web Share API or clipboard fallback.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading, persisting, and clearing URL parameters and session-based values.",
  "frontend/src/utils/waitForActorReady.ts": "Waits for the actor query to become ready, handling timeouts and initialization states for React Query.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, responsive screens, animations, and plugins for typography, container queries, and animation utilities.",
  "project_state.json": "Tracks project metadata and feature requests related to adding a delete option for abuser profiles in a dropdown, including existing features and pending requests."
}