{
  "backend/main.mo": "Main Motoko canister defining the core domain models (incidents, messages, evidence, summaries, police submissions, sharing, SMS logs) and integrating authorization, storage, HTTP outcalls, and external modules to power the backend logic.",
  "backend/police-department.mo": "Defines the PoliceDepartment type with basic identifying and contact fields used across the backend and frontend.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile type capturing optional personal, address, vehicle, and social details about a suspected stalker.",
  "feature_evidence.json": "Feature specification describing frontend changes for police department autofill using backend lookup, including files touched, dependencies, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of major frontend components, hooks, and styles used to guide understanding and build planning.",
  "frontend/index.css": "Global Tailwind CSS configuration defining light and dark theme design tokens, color system, and base element styling.",
  "frontend/index.html": "HTML entry point configuring metadata, PWA support, icons, SEO, and mounting the React application.",
  "frontend/public/manifest.json": "PWA manifest defining app identity, icons, theme colors, orientation, categories, and a shortcut for creating new incident reports.",
  "frontend/public/service-worker.js": "Custom service worker implementing precaching, runtime caching, offline fallback behavior, and update lifecycle handling for the PWA.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile setup flow, theming, layout, and top-level routing between login, setup, and main content.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty or placeholder component file intended for a future analytics dashboard.",
  "frontend/src/components/CrimeHelp.tsx": "Renders a static educational page with cards explaining women’s legal rights, crime definitions, and safety resources, including a button linking to an external legal resource site.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with copyright text, a heart icon, and an external link crediting caffeine.ai.",
  "frontend/src/components/Header.tsx": "Implements the top navigation header with app branding, login/logout using Internet Identity, user profile display, and a light/dark theme toggle.",
  "frontend/src/components/IncidentDetail.tsx": "Shows detailed information for a single incident, including messages, evidence, stalker info, and police department lookup, with actions for generating messages and reporting to police.",
  "frontend/src/components/IncidentForm.tsx": "Provides a multi-step form to create or supplement an incident report, upload and link evidence files, select stalker profiles, validate input, and submit data via API hooks.",
  "frontend/src/components/IncidentHistory.tsx": "Fetches and displays the user’s incident list with loading and error states, allows selecting an incident to view details, and opens summaries in a modal.",
  "frontend/src/components/InstallationGuide.tsx": "Provides an installation and sharing guide with predefined social share message options, images, and copy to promote the ReportHer app across platforms.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Fetches and displays an interactive summary of a user’s incident history, including dates, locations, evidence, and tone intensity, with loading and error states.",
  "frontend/src/components/LoginPrompt.tsx": "Renders a marketing-style login screen that explains ReportHer’s purpose and features and initiates Internet Identity authentication.",
  "frontend/src/components/MainContent.tsx": "Acts as the main authenticated dashboard, managing tabs and navigation between core features like incident reporting, history, profiles, police submissions, and guides.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Empty or placeholder component file with no implemented content.",
  "frontend/src/components/MessageGenerator.tsx": "UI for generating harassment warning or documentation messages based on selected tone and intensity, calling a backend mutation and handling success or error feedback.",
  "frontend/src/components/MessageList.tsx": "Renders a list of generated messages with metadata, tone/intensity badges, and actions to copy, share, or send via SMS while logging SMS usage to the backend. Handles loading and empty states and formats timestamps for display.",
  "frontend/src/components/MotivationalVideo.tsx": "Displays an authenticated-only button that opens a dialog with a motivational video, managing loading, play/pause state, and manual playback controls. Uses a modal dialog with custom UI overlays and buffering indicators.",
  "frontend/src/components/PoliceReportDialog.tsx": "Provides a dialog for submitting a police report with selected evidence, optional victim info and summary, and a required legal disclaimer acknowledgment. Calculates evidence size, manages selection state, and submits data via backend mutations with success/error feedback.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Fetches and displays a chronological history of police submission logs, including evidence details, file icons, sizes, and submission outcomes. Handles loading, error, and empty states with clear status indicators.",
  "frontend/src/components/ProfileSetup.tsx": "Simple onboarding form that collects and saves the user's name to create a caller profile. Includes basic validation, submission state handling, and success/error toasts.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Shows a conditional prompt encouraging users to install the app as a PWA, handling browser install events, iOS-specific instructions, and dismissal persistence. Hides itself when already installed or recently dismissed.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "React component that lists saved stalker profiles, allowing users to view, edit, delete, and load profiles via dialogs, using React Query hooks for CRUD operations.",
  "frontend/src/components/StalkerRecord.tsx": "Main form component for creating and managing a stalker record, saving profiles, and associating police departments, with tabs, dialogs, and integration of SavedStalkerProfiles.",
  "frontend/src/components/VictimProfile.tsx": "Form component for viewing and optionally saving a victim’s personal profile, handling local state changes and persisting data via React Query hooks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, handling authentication, admin access initialization, and query invalidation on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity, managing login, logout, identity persistence, and exposing login status and identity state to the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, stalker profiles, victim data, police departments, and related mutations with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base/components/utilities and extensive CSS variables for light and dark themes using OKLCH colors, including sidebar and chart palettes. Adds custom gradient utilities and mobile/extra-small breakpoint utilities for responsive styling.",
  "frontend/src/main.tsx": "Bootstraps the React application by creating the root, loading global styles, and wrapping the App with React Query and Internet Identity providers.",
  "frontend/src/types.ts": "Re-exports shared domain types and enums from the backend to keep frontend and backend type definitions consistent.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query strings or hash routing, persist them in sessionStorage, and safely retrieve or clear them across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with class-based dark mode, custom breakpoints, container settings, OKLCH color tokens backed by CSS variables, animations, and several official plugins.",
  "project_state.json": "Stores high-level project metadata and a structured snapshot of current scope, features, and versions for the ReportHer application to support planning and state tracking."
}