{
  "backend/main.mo": "Defines the main Motoko actor with all core domain types for incidents, messages, evidence, summaries, police submissions, and victim/stalker profiles.",
  "backend/police-department.mo": "Defines the PoliceDepartment record type containing basic department contact and address fields.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile type storing optional personal, location, vehicle, and social media details about a suspect.",
  "feature_evidence.json": "Lists feature definitions, related files, components, and test IDs for Quick Exit functionality and its configuration.",
  "frontend-file-summaries.txt": "Provides text summaries of various frontend components and hooks, including functionality, UI behavior, and integrations.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes for light/dark modes with OKLCH color tokens and base styling rules.",
  "frontend/index.html": "HTML entry point configuring metadata, PWA settings, theming, and bootstrapping the React application.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, categories, shortcuts, and display behavior for the Reporther app.",
  "frontend/public/service-worker.js": "Implements service worker logic for caching, runtime updates, offline handling, and message-based skip-waiting support.",
  "frontend/src/App.tsx": "Main app component handling authentication state, profile setup flow, quick-exit shortcut, theming, and layout structure.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/CrimeHelp.tsx": "Renders educational cards and links providing crime-related legal information and resources.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar managing authentication actions, theme toggling, quick-exit, and displaying the user avatar.",
  "frontend/src/components/IncidentDetail.tsx": "Shows detailed incident info including messages, evidence, stalker data, and police department selection with various UI actions.",
  "frontend/src/components/IncidentForm.tsx": "Form for creating incident reports with validation, evidence uploads, and optional stalker profile selection.",
  "frontend/src/components/IncidentHistory.tsx": "Displays a user's incident history, handles loading and errors, and shows details or summaries when selected.",
  "frontend/src/components/InstallationGuide.tsx": "Provides installation instructions and shareable messages for adding the app to mobile devices.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Fetches and displays an aggregated incident summary with tone analysis, handling loading and error states.",
  "frontend/src/components/LoginPrompt.tsx": "Shows a login screen with feature highlights and triggers Internet Identity authentication.",
  "frontend/src/components/MainContent.tsx": "Hosts the main tabbed interface for user profile, reports, incident history, and other tools.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/MessageGenerator.tsx": "UI for selecting tone and intensity to generate a contextual message and submit it via a mutation.",
  "frontend/src/components/MessageList.tsx": "Displays generated messages with actions for copying, sharing, SMS sending, and shows tone/intensity labels.",
  "frontend/src/components/MotivationalVideo.tsx": "Empty placeholder component with no content.",
  "frontend/src/components/PoliceReportDialog.tsx": "Dialog for assembling and submitting a police report with selected evidence, victim info options, and validations.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Fetches and displays a history of police submissions with evidence details and submission status.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form for saving a user's name to create a personalized caller profile.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Handles showing and managing a PWA installation prompt with iOS support and dismissal tracking.",
  "frontend/src/components/QuickExitSettings.tsx": "UI for viewing, validating, saving, and resetting the Quick Exit redirect URL with error handling and toasts.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "Displays, views, edits, and deletes saved stalker profiles using dialogs and query hooks.",
  "frontend/src/components/StalkerRecord.tsx": "Manages current stalker info, saved profiles, and police department selection with tabs, forms, and CRUD operations.",
  "frontend/src/components/VictimProfile.tsx": "Allows users to view and update optional victim profile data with form handling and secure save operations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Derives actor readiness, initialization, and error state from React Query cache and useActor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, identity loading, and status management through a React context.",
  "frontend/src/hooks/useLocalStorageState.ts": "Provides a React hook that syncs state with localStorage and updates storage on changes.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installation state, detects install capability, and triggers the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, stalker, and related backend data via an actor.",
  "frontend/src/index.css": "Configures Tailwind and theme variables for light/dark modes plus custom gradients and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/types.ts": "Re-exports backend types and enums for consistent frontend typing.",
  "frontend/src/utils/actorInitErrorMessage.ts": "Maps actor initialization and network errors to user-friendly messages.",
  "frontend/src/utils/quickExit.ts": "Implements a quick-exit system for redirecting to a safe URL with validation and storage.",
  "frontend/src/utils/shareLink.ts": "Provides utilities for copying or sharing URLs using clipboard or Web Share API.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, session persistence, and safe cleanup of parameters from the hash.",
  "frontend/src/utils/waitForActorReady.ts": "Waits for actor initialization by monitoring React Query state with timeout handling.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, custom colors via CSS variables, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "JSON file describing project metadata, existing quick-exit feature requirements, and a pending new feature request."
}