{
  "backend/main.mo": "Defines the primary actor with all domain types for incidents, messages, evidence, police submissions, and summaries, integrating migration and external modules.",
  "backend/migration.mo": "Adds a new userSelectedDepartments map to the actor state and migrates old actor data to the new structure.",
  "backend/police-department.mo": "Defines the PoliceDepartment type with basic contact and address fields.",
  "backend/stalker-profile.mo": "Defines the StalkerProfile type containing identifying, location, and descriptive information about a suspect.",
  "feature_evidence.json": "Lists feature evidence items connecting specific frontend files to requirements about persisting and loading the user’s selected police department.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of various frontend files, describing their purpose and recent behavioral changes.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark modes and applying base theming.",
  "frontend/index.html": "HTML entry point setting up PWA metadata, icons, SEO tags, and mounting the root application.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons, categories, and shortcuts.",
  "frontend/public/service-worker.js": "Service worker implementing precaching, runtime caching, activation cleanup, offline fallback, and message handling for PWA updates.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile loading, and routing between login, profile setup, and main content with theming.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/CrimeHelp.tsx": "Displays educational cards and links about legal rights, crime definitions, and safety resources.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header bar handling login/logout, theme toggling, and showing user profile info.",
  "frontend/src/components/IncidentDetail.tsx": "Shows detailed information for a selected incident, including messages, evidence, and police department handling logic.",
  "frontend/src/components/IncidentForm.tsx": "Form for creating or supplementing incident reports with validation and evidence file uploads.",
  "frontend/src/components/IncidentHistory.tsx": "Displays the user's list of incidents with loading/error states and supports selecting an incident to view details.",
  "frontend/src/components/InstallationGuide.tsx": "Provides share message templates and UI for recommending the app, including predefined message types, images, and copy/share actions.",
  "frontend/src/components/InteractiveSummaryView.tsx": "Fetches and displays an incident summary with formatting helpers, loading states, error handling, and intensity indicators.",
  "frontend/src/components/LoginPrompt.tsx": "Shows a branded login screen with feature highlights and triggers Internet Identity authentication.",
  "frontend/src/components/MainContent.tsx": "Hosts the main authenticated app tabs, routing between victim info, stalker info, incident forms, history, and other tools.",
  "frontend/src/components/MaleUserWarningMockup.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/MessageGenerator.tsx": "Renders UI to generate incident‑based messages with selectable tone and intensity, calling the backend to produce tailored text.",
  "frontend/src/components/MessageList.tsx": "Renders a list of generated messages with actions like copy, share, and SMS sending, including formatting helpers for metadata.",
  "frontend/src/components/MotivationalVideo.tsx": "Displays a motivational video in a dialog for authenticated users with loading, play/pause, and manual play controls.",
  "frontend/src/components/PoliceReportDialog.tsx": "Dialog for submitting a police report with selected evidence, victim info, and narrative, including validation and backend submission.",
  "frontend/src/components/PoliceSubmissionHistory.tsx": "Fetches and displays a user's police submission logs with evidence details, statuses, and formatted timestamps.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile creation form allowing users to submit their name and save it via a backend mutation.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Shows a conditional PWA installation prompt with support for Android and iOS behaviors and dismiss persistence.",
  "frontend/src/components/SavedStalkerProfiles.tsx": "UI component for listing, viewing, editing, and deleting saved stalker profiles using query hooks and dialogs.",
  "frontend/src/components/StalkerRecord.tsx": "Main form for creating stalker records, managing police departments, and switching between current and saved profiles.",
  "frontend/src/components/VictimProfile.tsx": "Form for viewing and editing the user's optional victim profile details stored via backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Computes actor readiness, initialization, and error state by inspecting React Query cache.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management through a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor methods for user profiles, stalker profiles, police departments, and related data.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme color variables for light/dark mode, custom gradients, and mobile utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/types.ts": "Re-exports shared backend types and enums for consistent frontend typing.",
  "frontend/src/utils/actorInitErrorMessage.ts": "Provides user-friendly actor initialization error messages and maps error patterns to readable text.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/src/utils/waitForActorReady.ts": "Waits for the React Query actor queries to finish initializing or erroring before proceeding.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, screens, animations, and plugin setup.",
  "project_state.json": "Project metadata tracking schema version, issues, and feature requests for police department persistence."
}