{
  "kind": "build_request",
  "title": "Add panic/abort (quick-exit) button that redirects to a weather website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a clearly visible, one-tap \"Quick Exit\" panic/abort control that is accessible from anywhere in the authenticated app UI (e.g., in the sticky header) and immediately redirects the current tab to a weather report website to disguise reporting activity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "are we able to add a panic button/abort button that if a woman is caught making a report, she can push the button and it will load a weather report website?"
        ]
      },
      "acceptanceCriteria": [
        "When the user activates the Quick Exit control, the app navigates away to the configured weather report URL immediately.",
        "The Quick Exit control is available across the app (not only on a single tab/screen).",
        "The redirect uses a navigation method that minimizes the ability to return to the app via the browser back button (e.g., replace-style navigation)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide a simple in-app way to configure the Quick Exit destination URL (weather report website) and persist it locally on the device (so it works without requiring login or backend changes). Include safe validation and a default value if none is set.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "are we able to add a panic button/abort button that if a woman is caught making a report, she can push the button and it will load a weather report website?"
        ]
      },
      "acceptanceCriteria": [
        "A user can view and edit the Quick Exit destination URL in the UI.",
        "The configured URL persists across reloads (local device persistence).",
        "Invalid/empty URL entries are rejected with an English error message and do not break the Quick Exit action.",
        "If the user has never configured a URL, Quick Exit still works by using the app’s default weather destination."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an optional fast activation shortcut for Quick Exit (keyboard shortcut on desktop and an additional placement within the incident reporting flow) without interfering with form submission or other critical actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "are we able to add a panic button/abort button that if a woman is caught making a report, she can push the button and it will load a weather report website?"
        ]
      },
      "acceptanceCriteria": [
        "A documented keyboard shortcut triggers Quick Exit on desktop browsers while the app is open.",
        "A Quick Exit action is available within the incident report creation screen so a user can leave quickly while reporting.",
        "Quick Exit activation does not require confirmation dialogs and does not trigger accidental form submission."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not add any third-party authentication; continue using Internet Identity only.",
    "Implement as a frontend-only feature (no backend state required) unless strictly necessary."
  ],
  "nonGoals": [
    "Implementing real-time alerts, messaging, or notifications triggered by the panic button.",
    "Wiping or deleting user data/evidence when Quick Exit is triggered.",
    "Adding analytics/tracking around Quick Exit usage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}