{
  "kind": "build_request",
  "title": "Fix DV Journal: abuser name is not persisted/loaded correctly",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Ensure the backend Domestic Violence Journal API persists and returns the abuser name for the authenticated caller (setAbuserName must be retrievable via getAbuserName after page refresh).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "It doesn't save the abuser's name in the domestic violence journal"
        ]
      },
      "acceptanceCriteria": [
        "After calling setAbuserName(\"Alex\"), a subsequent call to getAbuserName() (including after a full page reload) returns \"Alex\" for the same authenticated principal.",
        "If no journal exists for the caller, getAbuserName() returns an empty string (\"\"), not an error.",
        "If the caller is not authorized (no #user permission), the method traps with a clear \"Unauthorized\" message consistent with other DV journal methods."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the backend exposes/query-implements DV Journal read APIs used by the frontend so journal entries and the stored abuser name can be loaded reliably (getJournalEntries must return the caller’s entries without mutating/overwriting abuserName).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "It doesn't save the abuser's name in the domestic violence journal"
        ]
      },
      "acceptanceCriteria": [
        "getJournalEntries() returns the list of entries for the caller in the same order they were stored (most recent first if that is the current behavior).",
        "Calling addJournalEntry() must not reset/blank out an already-saved abuserName.",
        "When no journal exists, getJournalEntries() returns an empty array."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Fix the DV Journal frontend React Query cache invalidation/query keys so that saving an abuser name and adding entries always refreshes the correct DV Journal queries (no stale/empty abuser name shown after save or refresh).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "It doesn't save the abuser's name in the domestic violence journal"
        ]
      },
      "acceptanceCriteria": [
        "After saving an abuser name, the UI shows the saved name and it remains present after navigating away/back or reloading the app (while authenticated).",
        "React Query invalidation targets the actual keys used by DV journal queries (e.g., dvAbuserName, dvJournalEntries, dvJournalAnalysis for the current principal) rather than unused keys.",
        "If saving the abuser name fails due to an authorization/backend error, the user sees an English error message and the UI does not falsely indicate the name was saved."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other immutable frontend paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change the DV Journal feature set or UX beyond what is needed to make the abuser name persist and load correctly.",
    "Do not add new authentication providers (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}