{
  "kind": "build_request",
  "title": "Restore Reporther branding and app identity (name + man-behind-bars icon)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update all user-facing branding text to use the product name \"Reporther\" (and remove \"My Safety Tracker\" / \"Safety Tracker\" copy) across the landing/login experience and top app header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yes, it is supposed to say Reporther and have a picture of man behind bars as the icon"
        ]
      },
      "acceptanceCriteria": [
        "The login/unauthenticated landing page headline displays \"Reporther\" (not \"My Safety Tracker\").",
        "The app header brand/title displays \"Reporther\" (not \"Your Safety, Your Power\" or other personalized branding).",
        "No remaining occurrences of \"My Safety Tracker\" or \"Safety Tracker\" are shown in the core UI (header and login prompt) after this change."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the PWA/app metadata to identify the app as \"Reporther\" so it does not appear under the old/personalized name when installed or shared: update document title, Apple PWA title, OpenGraph/Twitter titles, and the Web App Manifest (name/short_name/description as needed) to match Reporther.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yes, it is supposed to say Reporther and have a picture of man behind bars as the icon"
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html <title> uses \"Reporther\".",
        "frontend/index.html apple-mobile-web-app-title is \"Reporther\".",
        "frontend/index.html og:title and twitter:title use \"Reporther\".",
        "frontend/public/manifest.json name and short_name are set to \"Reporther\".",
        "After installing as a PWA, the installed app name shows as \"Reporther\"."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the current app icon set (favicon + PWA icons) with a \"man behind bars\" icon, and update all references so the new icon is used everywhere it is currently referencing the private-app icon assets (HTML favicon, Apple touch icon, manifest icons, and any in-app logo images).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yes, it is supposed to say Reporther and have a picture of man behind bars as the icon"
        ]
      },
      "acceptanceCriteria": [
        "A new icon image set exists in frontend/public/assets/generated and is referenced by frontend/index.html and frontend/public/manifest.json.",
        "Header logo image uses the new Reporther icon asset (not /assets/generated/private-app-icon-192.dim_192x192.png).",
        "LoginPrompt hero/logo image uses the new Reporther icon asset (not /assets/generated/private-app-icon-192.dim_192x192.png).",
        "Manifest icons and shortcut icon reference the new Reporther icon assets (not private-app-*).",
        "Favicon (<link rel='icon'>) and og:image/twitter:image point at the new Reporther icon/fav asset."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure this build does not conflict with or overwrite the existing regular Reporther app identity in the browser by updating the service worker cache naming and precache icon URLs to align with the updated Reporther icon filenames (and remove old private-app icon entries from the precache list).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it needs to be removed from there"
        ]
      },
      "acceptanceCriteria": [
        "frontend/public/service-worker.js CACHE_NAME and RUNTIME_CACHE are updated to a Reporther-specific value (not 'my-safety-tracker-*').",
        "The PRECACHE_URLS icon entries reference the new Reporther icon filenames and do not include private-app icon filenames.",
        "After a refresh with the updated service worker, the app loads without 404s for icon assets and uses the new icon in cached/offline scenarios."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add new product features beyond branding/icon/identity changes.",
    "Do not implement third-party authentication; only Internet Identity remains.",
    "Do not change backend data models unless required for branding (not expected)."
  ],
  "imageRequirements": {
    "required": [
      "App icon illustration showing a man behind bars, bold and readable at small sizes (reporther-app-icon-192.dim_192x192.png)",
      "App icon illustration showing a man behind bars, bold and readable at small sizes (reporther-app-icon-512.dim_512x512.png)",
      "Square favicon illustration showing a man behind bars, bold and readable at small sizes (reporther-favicon.dim_200x200.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}