{
  "kind": "build_request",
  "title": "Add delete option for abuser profile in DV Journal saved-profiles dropdown",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the DV Journal \"Select from saved profiles\" dropdown (frontend/src/components/DVJournalSection.tsx), add a per-profile delete control directly in the dropdown list so a user can delete a saved abuser/stalker profile from within the dropdown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a delete button for the abuser profile in the drop down box"
        ]
      },
      "acceptanceCriteria": [
        "Each saved profile row in the dropdown shows the profile name and a visible delete button/icon.",
        "Clicking the delete button does not select/change the dropdown value (i.e., it only initiates delete).",
        "Deleting a profile removes it from the dropdown list after completion (list refreshes via React Query invalidation)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a confirmation step before deleting a profile from the DV Journal dropdown, and wire the delete action to the existing stalker profile deletion mutation (useDeleteStalkerProfile from frontend/src/hooks/useQueries.ts calling backend deleteStalkerProfile).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a delete button for the abuser profile in the drop down box"
        ]
      },
      "acceptanceCriteria": [
        "When a user clicks delete on a dropdown item, a confirmation dialog is shown with English text that clearly states the profile will be permanently deleted.",
        "Confirming triggers the delete mutation for the correct profile id; canceling performs no delete.",
        "On successful delete, show a success toast; on error, show an error toast with a helpful message.",
        "While deletion is in progress, the UI prevents double-submission (e.g., disables the confirm button and/or shows a loading state)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Handle local DV Journal name input state safely after a profile is deleted from the dropdown: if the deleted profile name currently matches the abuser name input field value, clear the input field and keep the user in an editable state (do not auto-save).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a delete button for the abuser profile in the drop down box"
        ]
      },
      "acceptanceCriteria": [
        "If the deleted profile name equals the current abuser name input value, the input is cleared after successful deletion.",
        "No automatic call is made to save/update the DV Journal abuser name as a side effect of deleting a saved profile."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Respect the existing single-actor backend architecture; no new backend canisters/services."
  ],
  "nonGoals": [
    "Adding a new backend API for deletion (use the existing deleteStalkerProfile).",
    "Adding profile editing/management features beyond delete-from-dropdown behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}