{
  "kind": "build_request",
  "title": "Fix evidence attachment so Police Report screen can select incident evidence",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Fix the incident evidence upload flow so uploaded evidence is actually persisted in the backend and appears in the Police Report submission dialog as selectable attachments. Specifically: (1) update `frontend/src/components/IncidentForm.tsx` so `uploadFile()` calls the existing React Query mutation `useSaveEvidenceFile()` (which calls backend `uploadEvidence`) instead of generating a fake evidenceId; (2) stop calling `useLinkEvidenceToIncident()` as a no-op for linking and treat backend `uploadEvidence(incidentId, ...)` as the source of truth for linking; (3) ensure the incident evidence React Query cache is invalidated/refetched after each successful upload so `IncidentDetail` and `PoliceReportDialog` receive a non-empty `availableEvidence` when evidence exists.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i can't attach evidence from the report"
        ]
      },
      "acceptanceCriteria": [
        "After documenting an incident and uploading at least 1 file, the incident detail view shows the uploaded evidence under “Attached Evidence”.",
        "Opening “Report to Police” for an incident with uploaded evidence shows those evidence items under “Attach Evidence”, and the user can select/deselect them and submit.",
        "No part of the evidence upload flow uses fake/generated evidence IDs (e.g., `BigInt(Date.now())`) as a substitute for the backend’s returned `EvidenceMeta.id`.",
        "`useLinkEvidenceToIncident()` is no longer used to imply evidence linking; evidence appears for an incident solely by calling backend `uploadEvidence(incidentId, ...)`."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add clear, user-facing error handling for evidence upload failures in `frontend/src/components/IncidentForm.tsx`: if an upload fails, show an English toast message that (a) states the specific file failed to attach, and (b) suggests retrying. Also ensure the UI does not mark the file as “Uploaded successfully” unless the backend `uploadEvidence` call succeeded and returned `EvidenceMeta`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i can't attach evidence from the report"
        ]
      },
      "acceptanceCriteria": [
        "If backend evidence upload fails, the file remains in a non-uploaded state in the UI and a toast explains the failure and suggests retrying.",
        "If backend evidence upload succeeds, the UI marks the file as uploaded and the incident evidence list updates without requiring a full page refresh."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; do not introduce additional backend services.",
    "Do not edit any frontend files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement actual binary file blob storage/download in this change (store evidence metadata only, as currently supported by backend `uploadEvidence`).",
    "Do not change Police Department lookup or the overall Police Report submission flow beyond what is necessary to make evidence attachment work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}