{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persist and prefer saved police department in Report to Police flow (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Load and keep the user’s previously saved police department available across navigation/reload for the incident “Report to Police” flow, with safe disabled-state messaging when unavailable.",
      "acceptanceCriteria": [
        "After the user sets/saves a police department in the Stalker Info area and navigates to an incident detail page, the \"Submitting to\" department shown in the police report dialog matches the saved department.",
        "Refreshing the browser while on the incident detail page still results in a police department being available for \"Report to Police\" (assuming one was previously saved).",
        "If no police department has been saved and no valid address is available, the app shows an actionable message and keeps \"Report to Police\" disabled (no crash)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for saved police department persistence using existing backend capabilities (getSelectedDepartment/saveSelectedDepartment/clearSelectedDepartment) and a stable queryKey (e.g., ['selectedDepartment', principal])."
        },
        {
          "path": "frontend/src/components/IncidentDetail.tsx",
          "operation": "modify",
          "description": "On mount, fetch and prefer the saved police department (via the new React Query hook) so the Report to Police button and dialog use it after navigation/reload; keep Report to Police disabled with an actionable English message when neither a saved department nor a valid address exists."
        },
        {
          "path": "frontend/src/components/PoliceReportDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog is only openable when a non-null department object is present (consistent with IncidentDetail enablement) and that the displayed \"Submitting to\" section reflects the provided department prop."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Save the selected police department from the Stalker Info area using persistence hooks, with English success/error toasts and React Query cache invalidation so subsequent page loads reflect the saved value.",
      "acceptanceCriteria": [
        "Saving/choosing a police department triggers a successful mutation and shows an English success toast; failures show an English error toast.",
        "React Query caches for the saved police department are invalidated on success, and a reload of the page reflects the saved department without additional user action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement mutations for saving and optionally clearing the caller’s selected department, and invalidate/refetch the selected department query on success so all pages read the persisted value."
        },
        {
          "path": "frontend/src/components/StalkerRecord.tsx",
          "operation": "modify",
          "description": "Wire Stalker Info police department selection (dropdown/manual save/autolookup result) to call the save-selected-department mutation; show English success/error toasts; invalidate/refetch React Query caches related to the saved selection."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update incident detail report-to-police logic to load the saved department on mount and prevent auto-lookup effects from clearing/replacing it unless the user manually refreshes or no saved department exists.",
      "acceptanceCriteria": [
        "When a saved department exists, the incident detail page enables \"Report to Police\" without requiring an auto-lookup call.",
        "Auto-refresh/lookup does not clear or replace the saved department automatically; manual \"Refresh Police Dept\" may update it according to the designed behavior.",
        "The PoliceReportDialog always receives a non-null department object when the button is enabled and opened."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IncidentDetail.tsx",
          "operation": "modify",
          "description": "Refactor the auto-refresh effect so it does not run (or does not mutate currentPoliceDepartment) when a saved department exists; allow manual refresh to re-run lookup and (if successful) persist the refreshed department via the save-selected-department mutation, keeping button enablement and dialog inputs consistent."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Expose a composable API from hooks to support IncidentDetail behavior: a query for the saved department and a mutation to overwrite it when manual refresh is explicitly triggered."
        }
      ]
    }
  ]
}