{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix DV Journal frontend query keys & React Query invalidation for abuser name persistence",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Align DV Journal React Query query keys/invalidation so saving abuser name and adding entries refreshes the correct cached data and surfaces backend/auth errors clearly.",
      "acceptanceCriteria": [
        "After saving an abuser name, the UI shows the saved name and it remains present after navigating away/back or reloading the app (while authenticated).",
        "React Query invalidation targets the actual keys used by DV journal queries (e.g., dvAbuserName, dvJournalEntries, dvJournalAnalysis for the current principal) rather than unused keys.",
        "If saving the abuser name fails due to an authorization/backend error, the user sees an English error message and the UI does not falsely indicate the name was saved."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDVJournalQueries.ts",
          "operation": "modify",
          "description": "Refactor DV Journal query key creation into shared helpers/constants (e.g., dvAbuserNameKey(principal), dvJournalEntriesKey(principal), dvJournalAnalysisKey(principal)) and update all queries/mutations to use them. Update mutation success handlers to invalidate/refetch only the actual DV Journal keys in use (remove/avoid invalidation of unused keys like dvJournal), and ensure invalidations are scoped to the current principal to prevent cross-user cache bleed. Also ensure mutation error paths propagate clear English messages (leveraging existing getActorErrorMessage) and do not optimistically update caches when principal is unavailable."
        },
        {
          "path": "frontend/src/components/DVJournalSection.tsx",
          "operation": "modify",
          "description": "Ensure the abuser-name input reliably reflects the latest loaded query data across refresh/navigation by syncing local input state with the fetched abuserName when the user is not actively editing, and avoid any UI state that could imply a successful save when the mutation fails (keep success toast only on resolved mutateAsync and ensure editing state is not cleared on error). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}