{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix incident evidence upload persistence and Police Report attachment selection",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Persist uploaded incident evidence via existing save mutation, remove no-op linking, and ensure evidence caches refetch so Incident Detail and Police Report dialog show selectable attachments.",
      "acceptanceCriteria": [
        "After documenting an incident and uploading at least 1 file, the incident detail view shows the uploaded evidence under “Attached Evidence”.",
        "Opening “Report to Police” for an incident with uploaded evidence shows those evidence items under “Attach Evidence”, and the user can select/deselect them and submit.",
        "No part of the evidence upload flow uses fake/generated evidence IDs (e.g., `BigInt(Date.now())`) as a substitute for the backend’s returned `EvidenceMeta.id`.",
        "`useLinkEvidenceToIncident()` is no longer used to imply evidence linking; evidence appears for an incident solely by calling backend `uploadEvidence(incidentId, ...)`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IncidentForm.tsx",
          "operation": "modify",
          "description": "Update `uploadFile()` to call `useSaveEvidenceFile().mutateAsync(...)` with the newly created incidentId and use the returned `EvidenceMeta.id` as the stored evidenceId; remove all usage of `useLinkEvidenceToIncident()` and any fake/generated evidence IDs; ensure the local file upload state only sets `uploaded: true` when the mutation succeeds and stores returned metadata needed by the UI."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Enhance `useSaveEvidenceFile()` to invalidate/refetch the incident evidence React Query cache after successful uploads (e.g., `['incidentEvidence', incidentId]`) so `IncidentDetail` and `PoliceReportDialog` receive updated non-empty `availableEvidence` without a full page refresh."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add user-facing error handling for evidence upload failures and ensure UI upload success state only reflects successful backend uploads.",
      "acceptanceCriteria": [
        "If backend evidence upload fails, the file remains in a non-uploaded state in the UI and a toast explains the failure and suggests retrying.",
        "If backend evidence upload succeeds, the UI marks the file as uploaded and the incident evidence list updates without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IncidentForm.tsx",
          "operation": "modify",
          "description": "Add explicit failure handling in the evidence upload flow: on mutation error, keep the file in a non-uploaded state, stop the uploading/progress UI, and show an English toast that includes the specific filename and suggests retrying; ensure the UI never shows “Uploaded successfully” unless `uploadEvidence` succeeded and returned `EvidenceMeta`."
        }
      ]
    }
  ]
}