{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Quick Exit panic/abort button with configurable weather redirect",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a globally available, clearly visible Quick Exit control in the authenticated app UI that immediately redirects the current tab to a weather website using replace-style navigation.",
      "acceptanceCriteria": [
        "When the user activates the Quick Exit control, the app navigates away to the configured weather report URL immediately.",
        "The Quick Exit control is available across the app (not only on a single tab/screen).",
        "The redirect uses a navigation method that minimizes the ability to return to the app via the browser back button (e.g., replace-style navigation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/quickExit.ts",
          "operation": "create",
          "description": "Add Quick Exit utilities: default weather destination, local persistence key, safe URL parsing/validation helper, and a single action function that triggers immediate redirect via replace-style navigation (e.g., window.location.replace) while safely falling back to the default when needed."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a clearly visible one-tap \"Quick Exit\" button in the sticky header that appears in the authenticated UI and calls the shared Quick Exit action. Use the shadcn-ui Button component for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide an in-app Quick Exit destination URL setting with local-device persistence, safe validation, and a default weather URL fallback.",
      "acceptanceCriteria": [
        "A user can view and edit the Quick Exit destination URL in the UI.",
        "The configured URL persists across reloads (local device persistence).",
        "Invalid/empty URL entries are rejected with an English error message and do not break the Quick Exit action.",
        "If the user has never configured a URL, Quick Exit still works by using the app’s default weather destination."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QuickExitSettings.tsx",
          "operation": "create",
          "description": "Create a small settings UI for viewing/editing the Quick Exit destination URL, persisting it locally (using the existing localStorage hook), validating input (http/https only), and showing an English inline error message/toast on invalid entries. Use shadcn-ui components (Card/Input/Button/Label/Alert as appropriate); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/InstallationGuide.tsx",
          "operation": "modify",
          "description": "Wire the new QuickExitSettings component into an existing in-app screen (append a \"Quick Exit\" section/card within the Install & Share tab) so users can configure the destination URL without adding new top-level routes. Use shadcn-ui layout components already used on this screen; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add optional fast Quick Exit activation via a desktop keyboard shortcut and an additional Quick Exit placement within the incident reporting flow, avoiding accidental form submission or other critical actions.",
      "acceptanceCriteria": [
        "A documented keyboard shortcut triggers Quick Exit on desktop browsers while the app is open.",
        "A Quick Exit action is available within the incident report creation screen so a user can leave quickly while reporting.",
        "Quick Exit activation does not require confirmation dialogs and does not trigger accidental form submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a global keydown listener while authenticated to trigger Quick Exit via a documented shortcut (e.g., Ctrl/Cmd+Shift+Q), ignoring events originating from inputs/textareas/selects/contenteditable and avoiding interference with normal typing or form submission. Call the shared Quick Exit action from the utility."
        },
        {
          "path": "frontend/src/components/IncidentForm.tsx",
          "operation": "modify",
          "description": "Add an additional Quick Exit button within the incident report creation screen (ensure it is type=\"button\" so it cannot submit the form), calling the shared Quick Exit action for immediate navigation away. Use the shadcn-ui Button component for consistent behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/QuickExitSettings.tsx",
          "operation": "modify",
          "description": "Document the chosen desktop keyboard shortcut in the Quick Exit settings UI (short explanatory text) so users can discover it, without adding extra routes. Use existing shadcn-ui typography/layout patterns; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}